trade_exp/src/Documents/СборкаТоваров/СборкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СборкаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee6f4ac0-3f39-4cd9-afb6-ffaa044566fe">
    <name>ВариантКомплектации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ee6e203-13d7-45c1-a07a-3d9d0e3231bc">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9f77527b-8df0-42ca-9d77-3ba0f3709b21">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01b20195-7857-404d-82be-3efae39c7c2c">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="42eddef1-f1c0-4c28-868f-c53ff3b76c66">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="36cdefc1-23ca-4fe3-b864-94f83040a429">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a0a01907-71fe-4924-bd74-638b110a692d">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="660a4c7d-a983-455d-8258-5307371c13f8">
    <name>ЗаказНаСборку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bd635e04-353a-4d71-8660-cf3ae445ab1c">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa07f5c4-d5c2-4cb2-9433-e9565f6a27d8">
    <name>СборкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b378b97-d647-4523-9e40-499cc5cb9eee">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b16013d8-0227-4894-95d4-41b953964e2b">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18bd1d8d-c087-4f99-851a-5d41d3f0ed51">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa56f4d-953f-4b01-8a6c-014d0f16ba19">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d54a0d94-be3f-45da-8629-94310dc2c049">
    <name>СтатусУказанияСерий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4df2676e-97ad-40e1-a0f7-004b51589b67">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad47fd7e-1b44-46ea-a233-e65b10329003">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1c19bc0a-7b96-4930-8c74-7f43350faf62">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="21273d28-ab1b-4162-bd26-2c807a08ec36">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4fa1b212-5596-4c95-a562-392b50315555">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="58fb0f17-d48c-462a-9f54-da6fc9a3ef43">
    <name>ВидыЗапасовУказаныВручную</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b14b82bc-d938-49a1-a8cf-9143fbe41013">
    <name>НоменклатураОсновногоКомпонента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dc6a6404-b09b-4240-846b-07c2552f4996">
    <name>ХарактеристикаОсновногоКомпонента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="85fa083b-56a3-4b85-88d5-3fae8995cdba">
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eedecc22-cbcd-473b-b0aa-431afe4253d1">
    <name>Кладовщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2d689016-6760-4f80-9b92-4c3194170afc">
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="23382591-d65c-433f-99ab-272d3cb7189f">
    <name>Патерностер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="52b01363-8774-4cb2-a192-b4017c48be6b">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7b7faa90-f406-40f9-aae7-287a64234bf7">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="75714917-2443-4e00-97e3-3f32e5c1c870">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="205a5d62-e0bd-4d13-ac4b-344c70e51e4e">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a25e3b0c-2647-4c12-aa53-991fe77955a6">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d08b2132-bc78-45e1-bd1a-275ae1675ac9">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="131bcf48-82b5-4e46-a42a-d7ef41bc417a">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="173cb865-b4b1-4057-9b23-0a67452e9528">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1d46cbbe-be1a-4196-b458-51037d7f1552">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b8557420-3eb9-4319-b879-086b506b92c1">
      <name>ДоляСтоимости</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b13549a2-838d-4d43-871f-eaef3170077e">
      <name>ОбъектРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="31b56b24-466c-4ac2-92fb-1e7585076ea3">
      <name>АналитикаОбъекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="189ed9ee-bcac-4a26-bd80-eab154590830">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="55930922-cabf-4c84-b3d5-63ce57042484">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b96dc5d5-30ae-41e0-b0a6-946b03ec4b15">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="81d92482-647e-458e-8830-527adc82dd00">
      <name>Кладовщик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b63343da-1dfb-4d09-820c-23e348d8c97f">
      <name>ВодительПогрузчика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="61b6d282-d8c7-49fc-bd00-4f5fc918399a">
    <name>ВидыЗапасовСписание</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f01cd6fc-52d1-409b-841d-2eb1fa787416">
      <name>ВидЗапасов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8c35380a-eacf-4a8d-bb24-cc57f770630d">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="02c4f505-4d64-4889-8bd8-65e91e2b13dd">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="45943e03-de62-46a7-98c8-094c0ef2b9cf">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="63b70021-4da8-4f46-a89f-e5338f24599f">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="cd40478a-aeef-47d3-9b75-8fc636b03906">
    <name>ВидыЗапасовОприходование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4b7135f7-99a3-45b7-a14d-40944b6fc047">
      <name>ВидЗапасов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="23d26675-8c40-4c0f-af88-73d5c9c12a0f">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a02a92b-aaeb-45ba-b5f0-b136bdfd8dcf">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f5486838-d74d-45ed-9dfb-ae6b42c4fbec">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e4571c94-ee32-40ef-9c7c-47550399d5b1">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8bfbd845-f266-496c-92ea-0d7b9ab8e7e4">
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3f2b62d1-0fd7-4fbe-8a7a-08a5824895b1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ac576dbc-4ef1-44b8-8eb2-af25f6800d5e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c39fd604-cebe-43b2-a496-ef4963c54a09">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b18a1074-c20d-4261-ae91-b03fe9a5a4a7">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="782a3e5d-4083-49eb-bbc2-f173ba8cf2fd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/Патерностеры/Патерностеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3347a283-ea6c-4862-9497-8f2154904bdb">
  <name>Патерностеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="28af626b-96d5-4031-ad57-dc748544f750">
    <name>Патерностер</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="35574121-fd65-43c5-9c07-79d36fc4fc55">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3c7bf49b-4de8-4064-b841-59c59fda6fb4">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="61b23e85-c677-44d9-a19b-6969f6adc4da">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/СборкаТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.ИсключитьИзКонтроля.Доступность= РольДоступна("РазрешитьИсключатьДокументыИзКонтроляОрдерногоУчета"); 
	Если ЗначениеЗаполнено(Объект.Патерностер) И Объект.Ссылка.Проведен Тогда       
		Элементы.ПроверитьПатерностер.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры

#Область Доработки_по_ордерной_схеме

&НаСервере
Процедура НастройкаОтображенияКомандыОформитьОрдера()
	
	Элементы.ФормаОформитьОрдера.Видимость = ОрдернаяСхемаПриОтгрузке И ОрдернаяСхемаПриПоступлении;		
	
КонецПроцедуры

&НаСервере
Процедура Док_ОформитьОрдераПослеНаСервере()
	Документы.СборкаТоваров.ОформитьОрдера(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Док_ОформитьОрдераПосле(Команда)
	Док_ОформитьОрдераПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Док_СкладПриИзмененииПосле(Элемент)
	НастройкаОтображенияКомандыОформитьОрдера();
КонецПроцедуры

&НаКлиенте
Процедура Док_ДатаПриИзмененииПосле(Элемент)
	НастройкаОтображенияКомандыОформитьОрдера();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьОрдераПоДокументу(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Накладная = &Накладная
	|	И РасходныйОрдерНаТовары.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйОрдерНаТовары.Ссылка
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	|ГДЕ
	|	ПриходныйОрдерНаТовары.Распоряжение = &Накладная
	|	И ПриходныйОрдерНаТовары.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Накладная", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Функция ПроверитьИзменения()
	
	Если Объект.Ссылка.Склад <> Объект.Склад Или Объект.Ссылка.Номенклатура <> Объект.Номенклатура 
		Или Объект.Ссылка.КоличествоУпаковок <> Объект.КоличествоУпаковок Или Объект.Товары.Количество() <> Объект.Ссылка.Товары.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Индекс = 0;
	
	Для Каждого Стр Из Объект.Ссылка.Товары Цикл
		Если Стр.Номенклатура <> Объект.Товары[Индекс].Номенклатура Или Стр.КоличествоУпаковок <> Объект.Товары[Индекс].КоличествоУпаковок Тогда
			Возврат Истина;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат Ложь;	
	
КонецФункции	

&НаКлиенте
Процедура Док_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОрдераПоДокументу(Объект.Ссылка) и ПроверитьИзменения()  Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект);	
		
		ПоказатьВопрос(Оповещение,"Если необходимо сохранить изменения в документе, нажмите 'Ок' и кнопку 'Оформить ордера', если нет, то нажмите 'Отмена'",РежимДиалогаВопрос.ОКОтмена,0,КодВозвратаДиалога.ОК);  
	КонецЕсли; 
	//--  
	Если ЗначениеЗаполнено(Объект.Патерностер) Тогда 
		Если ПолучитьСкладПатерностера() <> Объект.Склад Тогда
			Сообщить("Выбран патерностер с другого склада!!! Повторите выбор!");
			Объект.Патерностер = Неопределено;
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПатерностер",ЭтотОбъект);
	Если ЗначениеЗаполнено(Объект.Патерностер) Тогда
		ЗанятостьПатерностера = ПроверитьЗанятостьПатерностера(); 
		Если ЗанятостьПатерностера.Свойство("Занятость") Тогда
			Если  ЗанятостьПатерностера.Занятость = 1  Тогда
				ПатерностерЗанят = Истина; 
			Иначе     
				ПатерностерЗанят = Ложь;
			КонецЕсли;	
			
			Если Не ПатерностерЗанят Тогда  
				ЗаписатьПатерностерВРегистр();			 
			ИначеЕсли Объект.Патерностер <> ЗанятостьПатерностера.Патерностер Или Объект.Номенклатура <> ЗанятостьПатерностера.Номенклатура Или Объект.Характеристика <> ЗанятостьПатерностера.Характеристика Тогда
				ПоказатьВопрос(Оповещение,",Данный вал уже занят, заменить значение 'Ок', если нет, то нажмите 'Отмена'",РежимДиалогаВопрос.ОКОтмена,0,КодВозвратаДиалога.ОК);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли  ЗначениеЗаполнено(Объект.Характеристика) Тогда  
				
		Если ПроверитьНаличиеПатерностераВРегистре() Тогда
			ПоказатьВопрос(Оповещение,",Патерностер не выбран, очистить значение в регистре 'Ок', если нет, то нажмите 'Отмена'",РежимДиалогаВопрос.ОКОтмена,0,КодВозвратаДиалога.ОК);
		КонецЕсли;
	КонецЕсли;	
//-- 
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеПатерностераВРегистре()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Патерностеры.Патерностер КАК Патерностер
	|ИЗ
	|	РегистрСведений.Патерностеры КАК Патерностеры
	|ГДЕ
	|	Патерностеры.Склад = &Склад
	|	И Патерностеры.Номенклатура = &Номенклатура
	|	И Патерностеры.Характеристика = &Характеристика
	|	И НЕ Патерностеры.Патерностер = ЗНАЧЕНИЕ(Справочник.Патерностеры.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Характеристика", Объект.Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт

Если Результат = КодВозвратаДиалога.ОК Тогда
	ИзменитьСтатусы();
ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
	ЭтаФорма.Прочитать();
КонецЕсли;	

КонецПроцедуры

Процедура ИзменитьСтатусы()
Документы.СборкаТоваров.ПоменятьСтатусыУРасходныхПриходныхОрдеров(Объект.Ссылка);	
КонецПроцедуры
#КонецОбласти

#Область ПодборХарактеристикБезОстатка
&НаКлиенте
Процедура ВыбиратьХарактеристикиБезОтатка(Команда)
ХарактеристикиБезОстатка = Не ХарактеристикиБезОстатка;
Элементы.ХарактеристикиБезОстатка.Пометка = ХарактеристикиБезОстатка;
КонецПроцедуры

&НаКлиенте
Процедура Док_ХарактеристикаНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)

Если ХарактеристикиБезОстатка Тогда
	
	СтандартнаяОбработка = Ложь;
	
	СписокХарактеристикБезОстатка = ПолучитьСписокХарактеристик(Элементы.Товары.ТекущиеДанные.Номенклатура);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", СписокХарактеристикБезОстатка);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Подбор");
	
	ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора",ПараметрыОткрытия,ЭтаФорма,УникальныйИдентификатор,,,ОбработкаВыбора);
	
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
Если Значение = Неопределено Тогда
	Возврат;
КонецЕсли;

Элементы.Товары.ТекущиеДанные.Характеристика = Значение; 

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокХарактеристик(СтрНоменклатура)

Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
|ПОМЕСТИТЬ ВТ_Остатки
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
|ГДЕ
|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
|	И ТоварыНаСкладахОстатки.Склад = &Склад
|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
|ИЗ
|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
|		ПО (ХарактеристикиНоменклатуры.Ссылка = ВТ_Остатки.Характеристика)
|ГДЕ
|	ХарактеристикиНоменклатуры.Владелец = &Номенклатура
|	И ВТ_Остатки.ВНаличииОстаток ЕСТЬ NULL";

Запрос.УстановитьПараметр("Номенклатура", СтрНоменклатура);
Запрос.УстановитьПараметр("Склад", Объект.Склад);

Список = Новый СписокЗначений;
Выборка = Запрос.Выполнить().Выбрать();

Пока Выборка.Следующий() Цикл
	Список.Добавить(Выборка.Характеристика)
КонецЦикла;

Возврат Список;

КонецФункции 
#КонецОбласти

&НаКлиенте
Процедура Док_ПодобратьТоварыПеред(Команда)
	СФП_МаркерыКлиент.МаркерНачало("Сборка товаров: открытие формы подбора товаров", Объект.Номер);
КонецПроцедуры

&НаСервере
&После("УстановитьДоступностьЭлементовКомплектаВШапке")
Процедура Док_УстановитьДоступностьЭлементовКомплектаВШапке()
Элементы.Патерностер.Доступность = Элементы.Характеристика.Доступность;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПатерностерВРегистр()
РегистрыСведений.Патерностеры.ЗаписатьПатерностер(Объект.Склад,Объект.Номенклатура,Объект.Характеристика,Объект.Патерностер, Объект.Дата);
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗакрытияВопросаПатерностер(Результат, Параметры) Экспорт  
Если Результат = КодВозвратаДиалога.ОК Тогда	
	ЗаписатьПатерностерВРегистр();  
КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура Док_ПатерностерНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
Если ЗначениеЗаполнено(Объект.Склад) Тогда
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора = Новый Структура("Склад",Объект.Склад);
	Выбор = Новый Структура("Отбор", ЗначениеОтбора);    
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииВыбораПатерностера", ЭтаФорма);
	ОткрытьФорму("Справочник.Патерностеры.ФормаВыбора",Выбор,ЭтаФорма, , , , ОбработкаВыбора);  
КонецЕсли;	        
ПроверитьПатерностерВидимость();
КонецПроцедуры     

&НаКлиенте
Процедура ПриЗакрытииВыбораПатерностера(Значение, ДопПараметры) Экспорт

Если Значение = Неопределено Тогда  
	Возврат;
КонецЕсли;

Объект.Патерностер = Значение;  
Док_ПатерностерПриИзмененииПосле(Элементы.Патерностер);
КонецПроцедуры


&НаКлиенте
Процедура Док_ПроверитьПатерностерПосле(Команда) 
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("Патерностер", 1);  
ПараметрыФормы.Вставить("Склад", Объект.Склад);
ОткрытьФорму("Обработка.ПатерностерПроверкаНагрузки.Форма.Форма",ПараметрыФормы);
КонецПроцедуры


&НаКлиенте
Процедура Док_ПослеЗаписиПосле(ПараметрыЗаписи)
ПроверитьПатерностерВидимость();		
КонецПроцедуры   

&НаСервере
Процедура ПроверитьПатерностерВидимость() 
Если ЗначениеЗаполнено(Объект.Патерностер) И Объект.Ссылка.Проведен Тогда       
	Элементы.ПроверитьПатерностер.Видимость = Истина; 
Иначе
	Элементы.ПроверитьПатерностер.Видимость = Ложь;	
КонецЕсли;
КонецПроцедуры	    


&НаКлиенте
Процедура Док_ПатерностерПриИзмененииПосле(Элемент)  
ОчиститьСообщения();
Если ЗначениеЗаполнено(Объект.Патерностер) Тогда 
	Если ПолучитьСкладПатерностера() <> Объект.Склад Тогда
		Сообщить("Выбран патерностер с другого склада!!! Повторите выбор!");
		Объект.Патерностер = Неопределено;
		Возврат;
	КонецЕсли;	
КонецЕсли;	
Если ЗначениеЗаполнено(Объект.Патерностер) И Объект.Патерностер <> СтароеЗначениеПатерностера() Тогда 
	ЗанятостьПатерностера = ПроверитьЗанятостьПатерностера(); 
	Если ЗанятостьПатерностера.Свойство("Занятость") Тогда
		Если  ЗанятостьПатерностера.Занятость = 1  Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗанятыйПатерностер",ЭтотОбъект,ЗанятостьПатерностера.Характеристика);
			ПоказатьВопрос(Оповещение,СтрШаблон("На данном валу уже хранится - %1. Заменить на данном валу - 'Ок', для выбора свободного вала, нажмите - 'Отмена'. Свободные валы - %2",ЗанятостьПатерностера.Номенклатура,ЗанятостьПатерностера.СвободныеВалы),РежимДиалогаВопрос.ОКОтмена,0,КодВозвратаДиалога.ОК);
		КонецЕсли; 
	КонецЕсли;
КонецЕсли;
Если Не ЗначениеЗаполнено(Объект.Патерностер) Тогда
	ПроверитьПатерностерВидимость();
КонецЕсли;	
КонецПроцедуры    

&НаСервере
Функция СтароеЗначениеПатерностера()  
Возврат Объект.Ссылка.Патерностер;
КонецФункции	

&НаСервере
Функция ПроверитьЗанятостьПатерностера()    
Если НЕ Объект.Ссылка.Пустая() Тогда    
	ДатаДляЗапроса = Объект.Дата;
Иначе
	ДатаДляЗапроса = ТекущаяДата();
КонецЕсли;
Возврат РегистрыСведений.Патерностеры.ПроверитьЗанятостьПатерностера(Объект.Склад, Объект.Номенклатура, Объект.Характеристика, Объект.Патерностер, ДатаДляЗапроса);	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗанятыйПатерностер(Результат, Параметры) Экспорт

Если Результат = КодВозвратаДиалога.ОК Тогда 
	ЗаписатьПатерностерВРегистр();;   
ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда   
	Объект.Патерностер = СтароеЗначениеПатерностера();
КонецЕсли;	

КонецПроцедуры   

&НаСервере
Функция ПолучитьСкладПатерностера()
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	Патерностеры.Склад КАК Склад
|ИЗ
|	Справочник.Патерностеры КАК Патерностеры
|ГДЕ
|	Патерностеры.Ссылка = &Ссылка";

Запрос.УстановитьПараметр("Ссылка", Объект.Патерностер);

РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();

Если Выборка.Следующий() Тогда
	Возврат Выборка.Склад;	
КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Док_ПатерностерАвтоПодборПеред(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
ПараметрыПолученияДанных.Вставить("Отбор", Новый Структура("Склад", Объект.Склад));
КонецПроцедуры
